#include<stdio.h>
int main(){
    float score = 90.5;
    printf("Score: %.1f\n", score);

    return 0;
}

 //1. จากการผลการทดสอบ int เเละ float ที่ตัวเเปร 90.5 จากผลการทดสอบ int เก็บผลได้ 90
 //เเละ float เก็บผลได้ 90.5 เพราะ int ไม่สามารถเก็บค่าที่เป็นทศนิยมได้

 //2. การเลือกใช้ Data Type ให้ถูกต้องเพราะมีข้อความระวังคือถ้าเลือกใช้ผิดในเเต่ละงานอาจจะทำให้การเก็บ
 //ข้อมูลนั้นผิดพลาดได้
 
 //3. จากผลการทกสอบสามารถสรุปได้ว่าถ้าการเลือกใช้ Data Type หรืออาจจะใช้โดยที่ไม่รู้อาจจะทำให้การเก็บ
 //ข้อมูลของเราผิดพลาดหรืออาจจะส่งกระทบต่อหน้างานของเรา
